RunningChild/efm32_freertos_app/src/framework/components/app_timer/app_timer_drv.c
#include "app_timer_drv.h"
#include "em_cmu.h"
#include "em_common.h"
#include "em_int.h"
#include "em_rmu.h"
#include "em_emu.h"

#include "log.h"

#if (APP_TIMER_DRV_FREERTOS != APP_TIMER_DRV_SRC)
/******************************************************************************
                        硬件定时器实现偏移秒数和毫秒数
 *****************************************************************************/
#define TIMER_COUNTS_PER_SEC            (RTC_CLOCK/RTC_DIVIDER)
#define TIMER_COUNTS_PER_MSEC           ((TIMER_COUNTS_PER_SEC)/1000U)

static volatile uint32_t time_overflow_counter = 0;

/*******************************************************************************
 * @brief app_timer_get_wall_clock
 ******************************************************************************/
static uint32_t app_timer_get_wall_clock(const uint32_t counts_per_sec_or_millisec)
{
    uint32_t t = 0;
    uint32_t overflow_interval  =  ((uint64_t)RTC_COUNTER_MASK+1) / counts_per_sec_or_millisec;
    uint32_t overflow_interval_r = ((uint64_t)RTC_COUNTER_MASK+1) % counts_per_sec_or_millisec;

    t += time_overflow_counter * overflow_interval;
    if(overflow_interval_r != 0)
    {
        t += time_overflow_counter * overflow_interval_r / counts_per_sec_or_millisec;
    }

    t += (RTC_COUNTER_PASS() / counts_per_sec_or_millisec);

    return t;
}

/*******************************************************************************
 * @brief app_timer_get_second
 ******************************************************************************/
uint32_t app_timer_get_second(void)
{
    return app_timer_get_wall_clock(TIMER_COUNTS_PER_SEC);
}

/*******************************************************************************
 * @brief app_timer_get_millisecond
 ******************************************************************************/
uint32_t app_timer_get_millisecond(void)
{
    return app_timer_get_wall_clock(TIMER_COUNTS_PER_MSEC);
}

/******************************************************************************
                        软件定时器实现
 *****************************************************************************/

#define TIMER_COUNT_UP                  (1)
#define TIMER_COUNT_DOWN                (2)


// Maximum number of ticks per overflow period (not the maximum tick value)
#define MAX_RTC_TICK_CNT                (RTC_MAX_VALUE+1UL)
#define RTC_CLOSE_TO_MAX_VALUE          (RTC_MAX_VALUE-100UL)


#define MSEC_TO_TICKS_DIVIDER           ( 1000U * RTC_DIVIDER )
#define MSEC_TO_TICKS_ROUNDING_FACTOR   ( MSEC_TO_TICKS_DIVIDER / 2 )
#define MSEC_TO_TICKS( ms )             ( ( ( (uint64_t)(ms) * RTC_CLOCK )    \
                                            + MSEC_TO_TICKS_ROUNDING_FACTOR ) \
                                          / MSEC_TO_TICKS_DIVIDER )

#define TICKS_TO_MSEC_ROUNDING_FACTOR   ( RTC_CLOCK / 2 )
#define TICKS_TO_MSEC( ticks )          ( ( ( (uint64_t)(ticks)               \
                                              * RTC_DIVIDER * 1000U )         \
                                            + TICKS_TO_MSEC_ROUNDING_FACTOR ) \
                                          / RTC_CLOCK )

#define TICKS_TO_SEC_ROUNDING_FACTOR    ( RTC_CLOCK / 2 )
#define TICKS_TO_SEC( ticks )           ( ( ( (uint64_t)(ticks)               \
                                              * RTC_DIVIDER )                 \
                                            + TICKS_TO_SEC_ROUNDING_FACTOR )  \
                                          / RTC_CLOCK )
#define TICK_TIME_USEC                  ( 1000000 * RTC_DIVIDER / RTC_CLOCK )

typedef struct Timer
{
  uint64_t            remaining;
  uint64_t            ticks;
  int                 periodicCompensationUsec;
  unsigned int        periodicDriftUsec;
  RTCDRV_Callback_t   callback;
  bool                running;
  bool                doCallback;
  bool                allocated;
  RTCDRV_TimerType_t  timerType;
  void                *user;
} Timer_t;

static Timer_t            timer[ EMDRV_RTCDRV_NUM_TIMERS ];
static uint32_t           lastStart;
static volatile uint32_t  startTimerNestingLevel;
static bool               inTimerIRQ;
static bool               rtcRunning;
static bool               rtcdrvIsInitialized = false;


static void checkAllTimers( uint32_t timeElapsed );
static void delayTicks( uint32_t ticks );
static void executeTimerCallbacks( void );
static void rescheduleRtc( uint32_t rtcCnt );

/// @endcond

/***************************************************************************//**
 * @brief
 *    Allocate timer.
 *
 * @details
 *    Reserve a timer instance.
 *
 * @param[out] id The id of the reserved timer.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ALL_TIMERS_USED when no timers are available.@n
 *    @ref ECODE_EMDRV_RTCDRV_PARAM_ERROR if an invalid id pointer was supplied.
 ******************************************************************************/
Ecode_t RTCDRV_AllocateTimer( RTCDRV_TimerID_t *id )
{
  int i      = 0;
  int retVal = 0;

  INT_Disable();
  // Iterate through the table of the timers until the first available.
  while ( ( i < EMDRV_RTCDRV_NUM_TIMERS ) && ( timer[ i ].allocated ) ) {
    i++;
  }

  // Check if we reached the end of the table.
  if ( i == EMDRV_RTCDRV_NUM_TIMERS ) {
    retVal = ECODE_EMDRV_RTCDRV_ALL_TIMERS_USED;
  } else {
    // Check if a NULL pointer was passed.
    if ( id != NULL ) {
      timer[ i ].allocated = true;
      *id = i;
      retVal = ECODE_EMDRV_RTCDRV_OK;
    } else {
      retVal = ECODE_EMDRV_RTCDRV_PARAM_ERROR;
    }
  }
  INT_Enable();

  return retVal;
}

/***************************************************************************//**
 * @brief
 *    Millisecond delay function.
 *
 * @param[in] ms Milliseconds to stay in the delay function.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK.
 ******************************************************************************/
Ecode_t RTCDRV_Delay( uint32_t ms )
{
  uint64_t totalTicks;

  totalTicks = MSEC_TO_TICKS( ms );

