RunningChild/efm32_freertos_app/src/framework/components/app_timer/app_timer_drv.c
/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN
static void checkAllTimers( uint32_t timeElapsed )
{
  int i;

  // Iterate through the timer table.
  // Update time remaining, check for timeout and rescheduling of periodic
  // timers, check for callbacks.

  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    timer[ i ].doCallback = false;
    if ( timer[ i ].running == true ) {
      if ( timer[ i ].remaining > timeElapsed ) {
        timer[ i ].remaining -= timeElapsed;
      } else {
        if ( timer[ i ].timerType == rtcdrvTimerTypeOneshot ) {
          timer[ i ].running = false;
        } else {
          // Compensate overdue periodic timers to avoid accumlating errors.
          timer[ i ].remaining = timer[ i ].ticks - /*timeElapsed --->*/(timeElapsed/* % timer[ i ].ticks*/)/*<-- change by th*/ +
                                 timer[ i ].remaining;
          if ( timer[ i ].periodicCompensationUsec > 0 ) {
            timer[ i ].periodicDriftUsec += timer[i].periodicCompensationUsec;
            if (timer[ i ].periodicDriftUsec >= TICK_TIME_USEC) {
              // Add a tick if the timer drift is longer than the time of
              // one tick.
              timer[ i ].remaining += 1;
              timer[ i ].periodicDriftUsec -= TICK_TIME_USEC;
            }
          }
          else {
            timer[ i ].periodicDriftUsec -= timer[i].periodicCompensationUsec;
            if (timer[ i ].periodicDriftUsec >= TICK_TIME_USEC) {
              // Subtract one tick if the timer drift is longer than the time
              // of one tick.
              timer[ i ].remaining -= 1;
              timer[ i ].periodicDriftUsec -= TICK_TIME_USEC;
            }
          }
        }
        if ( timer[ i ].callback != NULL ) {
          timer[ i ].doCallback = true;
        }
      }
    }
  }

}

static void delayTicks( uint32_t ticks )
{
  uint32_t startTime;
  volatile uint32_t now;

  if ( ticks ) {
    startTime = RTC_COUNTERGET();
    do {
      now = RTC_COUNTERGET();
    } while ( TIMEDIFF( now, startTime ) < ticks );
  }
}

static void executeTimerCallbacks( void )
{
  int i;

  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    if ( timer[ i ].doCallback ) {

      //_by_pbh add debug
      volatile uint32_t isr_vector_num = (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk);

      if((16 + NVIC_IRQ_NUM) != isr_vector_num)
      {
        LOG(LEVEL_DEBUG,"[rtcdriver] timer_id=%d, irqn=%d", i, isr_vector_num);
      }

      timer[ i ].callback( i, timer[ i ].user );
    }
  }
}

static void rescheduleRtc( uint32_t rtcCnt )
{
  int i;
  uint64_t min = UINT64_MAX;

  // Find the timer with shortest timeout.
  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    if (    ( timer[ i ].running   == true )
         && ( timer[ i ].remaining <  min  ) ) {
      min = timer[ i ].remaining;
    }
  }

  rtcRunning = false;
  if ( min != UINT64_MAX ) {

    min = SL_MIN( min, RTC_CLOSE_TO_MAX_VALUE );

#if (32 != RTC_COUNTER_BITS)
    if ( inTimerIRQ == false ) {
      lastStart = ( rtcCnt ) & RTC_COUNTER_MASK;
    } else
#endif
    {
      lastStart = rtcCnt;
    }
    RTC_INTCLEAR( RTC_COMP_INT );

#if (TIMER_COUNT_UP == TIMER_COUNT_DIRECTION)
    RTC_COMPARESET( rtcCnt + min );
#elif (TIMER_COUNT_DOWN == TIMER_COUNT_DIRECTION)
    RTC_COMPARESET( rtcCnt - min );
#endif

    rtcRunning = true;

    // Reenable compare IRQ.
    RTC_INTENABLE( RTC_COMP_INT );
  }
}
/// @endcond

//_by_pbh add
bool RTCDRV_timer_check_running(RTCDRV_TimerID_t timer_id)
{
  return timer[timer_id].running;
}

/*******************************************************************************
 * @brief 中断处理函数
 ******************************************************************************/
void APP_TIMER_DRV_IRQHandler(void)
{
    uint32_t flags, timeElapsed, cnt, timeToNextTimerCompletion;

    INT_Disable();

    // CNT will normally be COMP0+1 at this point,
    // unless IRQ latency exceeded one tick period.

    flags = RTC_INTGET();

    if ( flags & RTC_COMP_INT ) {

        // Stop timer system by disabling the compare IRQ.
        // Update all timers with the time elapsed, call callbacks if needed,
        // then find the timer with the shortest timeout (if any at all) and
        // reenable the compare IRQ if needed.
        RTC_INTCLEAR( RTC_COMP_INT );

        inTimerIRQ = true;

        cnt = RTC_COUNTERGET();

        // This loop is repeated if CNT is incremented while processing.
        do {

            RTC_INTDISABLE( RTC_COMP_INT );

            timeElapsed = TIMEDIFF( cnt, lastStart );

            // Update all timers with elapsed time.
            checkAllTimers( timeElapsed );

            // Execute timer callbacks.
            executeTimerCallbacks();

            // Restart RTC according to next timeout.
            rescheduleRtc( cnt );

            cnt = RTC_COUNTERGET();
            timeElapsed = TIMEDIFF( cnt, lastStart );
            timeToNextTimerCompletion = TIMEDIFF( RTC_COMPAREGET(), lastStart );
            /* If the counter has passed the COMP(ARE) register value since we
            checked the timers, then we should recheck the timers and reschedule
            again. */
        }
        while ( rtcRunning && (timeElapsed > timeToNextTimerCompletion));
        inTimerIRQ = false;
    }

    if ( flags & RTC_OF_INT )
    {
        RTC_INTCLEAR( RTC_OF_INT );

        time_overflow_counter++;
    }

    INT_Enable();
}
#endif

